ЛИС2/src/Catalogs/ИсточникиЗагрязнения/ИсточникиЗагрязнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиЗагрязнения</name>
  <comment>В справочнике содержатся сведения об источниках загрязнения атмосферы (ИЗА), характеристики выбросов загрязняющих веществ.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦехУчасток</name>
    <type>
      <types>CatalogRef.ЦехаУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИВ</name>
    <type>
      <types>CatalogRef.ВидыИВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>EnumRef.ТипыИсточниковВыбросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГПУ</name>
    <type>
      <types>CatalogRef.ГазопылевыеУстановки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИЗА</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаОЗ</name>
    <type>
      <types>CatalogRef.ДизельныеУстановкиЭСН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточникаВыделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИсточника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеВентилятора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаВентилятора</name>
    <type>
      <types>CatalogRef.МаркиВентиляторов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительностьВентилятора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетанПоУчетуДУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТрубы</name>
    <type>
      <types>EnumRef.ВидыТрубыИЗА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаТруба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаТруба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипГПА</name>
    <type>
      <types>CatalogRef.ТипыГПА</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыX1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыX2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыY1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыY2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВССкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВСТемпература</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВСОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЭксплуатации</name>
    <type>
      <types>EnumRef.СостояниеЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТерриторииОбъекта</name>
    <type>
      <types>EnumRef.ТипыТерриторийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедетсяКонтрольВыбросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВырабатываетЭлектроТеплоЭнергию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойИсточникВыделения</name>
    <type>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсобоОхраняемойТерритории</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ИсточникиЗагрязнения/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// заполним некоторые параметры открытия формы для передачи их в переопределяемую форму выбора
	ФормаВыбораДляОткрытияПараметры = Новый Структура("РежимВыбора,ТекущаяСтрока");
	ЗаполнитьЗначенияСвойств(ФормаВыбораДляОткрытияПараметры, Параметры);
	ФормаВыбораДляОткрытияПараметры.РежимВыбора = Истина; // форма выбора всегда в режиме выбора
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	Если Параметры.Свойство("ОтборОбъектПлатыНВОС") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПроизводственнаяПлощадка.Владелец", 
		Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ТолькоИВ") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.ТолькоИВ = Истина Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Родитель");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Заполнено;
	    ЭлементОтбора.Использование    = Истина;
		Заголовок = "Источники выделения";
		
		ПризнакМетана = Ложь;
		Параметры.Отбор.Свойство("МетанПоУчетуДУ", ПризнакМетана);
		Если ПризнакМетана = Истина Тогда
			Заголовок = "Источники выделения метана";
			Элементы.Список.Подсказка = "Отображаются только источники выделения с установленным признаком 'Учет объема газа по данным ДУ'";
			Элементы.Список.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
		КонецЕсли;
		
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		
	ИначеЕсли Параметры.ТолькоИВ = Ложь Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Родитель");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	    ЭлементОтбора.Использование    = Истина;
		
		Элементы.НомерИсточникаВыделения.Видимость = 0;
		Элементы.ВидИВ.Видимость = 0;
		
		Заголовок = "Источники загрязнения";
		
			
	КонецЕсли;
	
	Если Параметры.Свойство("СписокИсключенныхИЗА") = Истина Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Родитель");
	    ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	    ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение	= Параметры.СписокИсключенныхИЗА;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПроизводственнаяПлощадка") = Истина Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПроизводственнаяПлощадка");
	    ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение	= Параметры.ПроизводственнаяПлощадка;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПереченьВидыИВ") = Истина Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ВидИВ");
	    ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение	= Параметры.ПереченьВидыИВ;
		
		Если Параметры.ПереченьВидыИВ.Количество() = 0 Тогда
			Элементы.Список.Подсказка = "По выбранной технологической операции не установлены виды ИВ." + Символы.ПС + "Выполните установку через документ 'Установка технологических операций видов источников выделения'.";
			Элементы.Список.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// если нет отбора по производственной площадке, организации или виду источника, то стандартная форма выбора будет не удобна для использования, откроем форму списка (она с иерархией) --старт
	ОткрытьТекущуюФормуВыбора = Ложь;
	
	ИскомыеПоляОтбора = Новый Массив;
	ИскомыеПоляОтбора.Добавить(Новый ПолеКомпоновкиДанных("ПроизводственнаяПлощадка"));
	ИскомыеПоляОтбора.Добавить(Новый ПолеКомпоновкиДанных("ПроизводственнаяПлощадка.Владелец"));
	ИскомыеПоляОтбора.Добавить(Новый ПолеКомпоновкиДанных("ВидИВ"));
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ИскомыеПоляОтбора.Найти(ЭлементОтбора.ЛевоеЗначение) <> Неопределено 
				И ЭлементОтбора.Использование Тогда
				
			ОткрытьТекущуюФормуВыбора = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Если Не ОткрытьТекущуюФормуВыбора Тогда
		ОткрытьФорму("Справочник.ИсточникиЗагрязнения.ФормаСписка",ФормаВыбораДляОткрытияПараметры,ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
		Закрыть(); // текущую форму выбора закрываем
	КонецЕсли;
	// если нет отбора по производственной площадке, организации или виду источника, то стандартная форма выбора будет не удобна для использования, откроем форму списка (она с иерархией) --финиш
	
КонецПроцедуры

#КонецОбласти
